In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
x = pd.DataFrame((np.random.randint(10,size = (3,4))))

In [4]:
x

   0  1  2  3
0  1  5  9  0
1  4  1  9  1
2  3  3  1  8

In [5]:
x.index # The index (row labels) of the DataFrame

RangeIndex(start=0, stop=3, step=1)

In [6]:
x.columns # The column labels of the DataFrame.

RangeIndex(start=0, stop=4, step=1)

In [7]:
x.dtypes # Return the dtypes in the DataFrame.

0    int32
1    int32
2    int32
3    int32
dtype: object

In [8]:
x.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int32
 1   1       3 non-null      int32
 2   2       3 non-null      int32
 3   3       3 non-null      int32
dtypes: int32(4)
memory usage: 180.0 bytes

In [9]:
x.describe()

              0    1         2         3
count  3.000000  3.0  3.000000  3.000000
mean   2.666667  3.0  6.333333  3.000000
std    1.527525  2.0  4.618802  4.358899
min    1.000000  1.0  1.000000  0.000000
25%    2.000000  2.0  5.000000  0.500000
50%    3.000000  3.0  9.000000  1.000000
75%    3.500000  4.0  9.000000  4.500000
max    4.000000  5.0  9.000000  8.000000

In [10]:
x.count()

0    3
1    3
2    3
3    3
dtype: int64

In [11]:
x.select_dtypes(include='int')

   0  1  2  3
0  1  5  9  0
1  4  1  9  1
2  3  3  1  8

In [12]:
x.select_dtypes(include='float')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [13]:
data = pd.DataFrame({
    'col1': [1, 2, 3],
    'col2': ['A', 'B', 'C'],
    'col3': [4.0, 5.5, 6.2],
    'col4': [True, False, True]
})

In [14]:
data.dtypes

col1      int64
col2     object
col3    float64
col4       bool
dtype: object

In [15]:
data.select_dtypes(include = 'int')

   col1
0     1
1     2
2     3

In [16]:
data.select_dtypes(include = 'float')

   col3
0   4.0
1   5.5
2   6.2

In [17]:
data.select_dtypes(include = 'object')

  col2
0    A
1    B
2    C

In [18]:
data.select_dtypes(include = 'bool')

    col4
0   True
1  False
2   True

In [19]:
data.select_dtypes(exclude = 'int')

  col2  col3   col4
0    A   4.0   True
1    B   5.5  False
2    C   6.2   True

In [20]:
data.select_dtypes(exclude = 'object')

   col1  col3   col4
0     1   4.0   True
1     2   5.5  False
2     3   6.2   True

In [21]:
# Return a subset of the DataFrame's columns based on the column dtypes.

In [22]:
x.values

array([[1, 5, 9, 0],
       [4, 1, 9, 1],
       [3, 3, 1, 8]])

In [23]:
data.values

array([[1, 'A', 4.0, True],
       [2, 'B', 5.5, False],
       [3, 'C', 6.2, True]], dtype=object)

In [24]:
# Return a Numpy representation of the DataFrame.

In [25]:
x.axes

[RangeIndex(start=0, stop=3, step=1), RangeIndex(start=0, stop=4, step=1)]

In [26]:
data.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['col1', 'col2', 'col3', 'col4'], dtype='object')]

In [27]:
# Return a list representing the axes of the DataFrame

In [28]:
x.ndim

2

In [29]:
data.ndim

2

In [30]:
# Return an int representing the number of axes / array dimensions.

In [31]:
x.size

12

In [32]:
data.size

12

In [33]:
# Return an int representing the number of elements in this object.

In [34]:
x.shape

(3, 4)

In [35]:
data.shape

(3, 4)

In [36]:
# Return a tuple representing the dimensionality of the DataFrame.

In [37]:
x.memory_usage('deep')

Index    132
0         12
1         12
2         12
3         12
dtype: int64

In [38]:
data.memory_usage('deep')

Index    132
col1      24
col2      24
col3      24
col4       3
dtype: int64

In [39]:
# Return the memory usage of each column in bytes.

In [40]:
x.empty

False

In [41]:
data.empty

False

In [42]:
# Indicator whether Series/DataFrame is empty.

# iloc

In [43]:
x = pd.DataFrame((np.random.randint(10,size = (3,4))))

In [44]:
x

   0  1  2  3
0  9  9  3  0
1  8  0  5  0
2  7  5  9  0

In [45]:
column_names = ['col1','col2','col3','col4']

In [46]:
x.columns = column_names

In [47]:
x

   col1  col2  col3  col4
0     9     9     3     0
1     8     0     5     0
2     7     5     9     0

In [48]:
sub = x['col1']

In [49]:
sub

0    9
1    8
2    7
Name: col1, dtype: int32

In [50]:
sub.iloc[0]

9

In [51]:
sub.iloc[0]=1

In [52]:
sub

0    1
1    8
2    7
Name: col1, dtype: int32

In [53]:
x

   col1  col2  col3  col4
0     1     9     3     0
1     8     0     5     0
2     7     5     9     0

In [54]:
pd.options.mode.copy_on_write = True

In [55]:
x

   col1  col2  col3  col4
0     1     9     3     0
1     8     0     5     0
2     7     5     9     0

In [56]:
sub = x['col1']

In [57]:
sub

0    1
1    8
2    7
Name: col1, dtype: int32

In [58]:
sub.iloc[0] = 100

In [59]:
sub

0    100
1      8
2      7
Name: col1, dtype: int32

In [60]:
x

   col1  col2  col3  col4
0   100     9     3     0
1     8     0     5     0
2     7     5     9     0

In [61]:
# astype

In [62]:
x.astype(float) # # Change the data type of all columns to float

    col1  col2  col3  col4
0  100.0   9.0   3.0   0.0
1    8.0   0.0   5.0   0.0
2    7.0   5.0   9.0   0.0

In [63]:
df = pd.DataFrame({
    'col1': [5, 9, 3],
    'col2': [2, 4, 7],
    'col3': [8, 3, 4],
    'col4': [9, 7, 3]
})

In [64]:
df

   col1  col2  col3  col4
0     5     2     8     9
1     9     4     3     7
2     3     7     4     3

In [65]:
df.dtypes

col1    int64
col2    int64
col3    int64
col4    int64
dtype: object

In [66]:
df = df.convert_dtypes()

In [67]:
df

   col1  col2  col3  col4
0     5     2     8     9
1     9     4     3     7
2     3     7     4     3

In [68]:
df.dtypes

col1    Int64
col2    Int64
col3    Int64
col4    Int64
dtype: object

In [69]:
x

   col1  col2  col3  col4
0   100     9     3     0
1     8     0     5     0
2     7     5     9     0

In [70]:
x.dtypes

col1    int32
col2    int32
col3    int32
col4    int32
dtype: object

In [71]:
x = x.convert_dtypes()

In [72]:
x

   col1  col2  col3  col4
0   100     9     3     0
1     8     0     5     0
2     7     5     9     0

In [73]:
x.dtypes

col1    Int32
col2    Int32
col3    Int32
col4    Int32
dtype: object

In [74]:
# Convert columns to the best possible dtypes using dtypes

In [77]:
x = x.infer_objects()

In [78]:
x

   col1  col2  col3  col4
0   100     9     3     0
1     8     0     5     0
2     7     5     9     0

In [79]:
x.dtypes

col1    Int32
col2    Int32
col3    Int32
col4    Int32
dtype: object

In [80]:
df = x.copy()

In [81]:
df # deep copy of the DataFrame

   col1  col2  col3  col4
0   100     9     3     0
1     8     0     5     0
2     7     5     9     0